// Задание 1
// Представьте, что у вас есть класс для управления библиотекой. В этом классе будет приватное свойство для хранения списка книг, а также методы для добавления книги, удаления книги и получения информации о наличии книги.

// Класс должен содержать приватное свойство #books, которое инициализируется пустым массивом и представляет собой список книг в библиотеке.

// Реализуйте геттер allBooks, который возвращает текущий список книг.

// Реализуйте метод addBook(title), который позволяет добавлять книгу в список. Если книга с таким названием уже существует в списке, выбросьте ошибку с соответствующим сообщением.

// Реализуйте метод removeBook(title), который позволит удалять книгу из списка по названию. Если книги с таким названием нет в списке, выбросьте ошибку с соответствующим сообщением.

// Реализуйте метод hasBook(title), который будет проверять наличие книги в библиотеке и возвращать true или false в зависимости от того, есть ли такая книга в списке или нет.

// Реализуйте конструктор, который принимает начальный список книг (массив) в качестве аргумента. Убедитесь, что предоставленный массив не содержит дубликатов; в противном случае выбрасывайте ошибку.

class Library {
    constructor(initialBooks = []) {
        this.#books = [...new Set(initialBooks)];
  }

  get allBooks() {
    return this.#books;
  }

  addBook(title) {
    if (this.#books.includes(title)) {
        throw new Error("Книга уже есть в библиотеке");
    } else {
        this.#books.push(title);
    }
  }

  removeBook(title) {
    if (!this.#books.includes(title)) {
        throw new Error("Книги с таким названием нет в библиотеке");
    } else {
        this.#books = this.#books.filter(book => book !== title);
    }
  }

  hasBook(title) {
    return this.#books.includes(title);
  }

  #books = [];
}

// Задание 2
// Вы разрабатываете систему отзывов для вашего веб-сайта. Пользователи могут оставлять отзывы, но чтобы исключить слишком короткие или слишком длинные сообщения, вы решаете установить некоторые ограничения.

// Создайте HTML-структуру с текстовым полем для ввода отзыва, кнопкой для отправки и контейнером, где будут отображаться отзывы.

// Напишите функцию, которая будет добавлять отзыв в контейнер с отзывами. Однако если длина введенного отзыва менее 50 или более 500 символов, функция должна генерировать исключение.

// При добавлении отзыва, он должен отображаться на странице под предыдущими отзывами, а не заменять их.

function addReview() {
    const reviewInput = document.getElementById("review-input").value;
    if (reviewInput.lenght < 50 || reviewInput.lenght > 500) {
        throw new Error("Отзыв должен содержать от 50 до 500 символов.");
    }

    const reviewContainer = document.getElementById("reviews-container");
    const newReview = document.createElement("div");
    newReview.className = "review";
    newReview.textContent = reviewInput;
    reviewContainer.appendChild(newReview);
}